request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://com/soap/template/webservices/basicservice">
	<soapenv:Header />
	<soapenv:Body>
		<gs:EchoRequest>ionadsfouiafnds</gs:EchoRequest>
	</soapenv:Body>
</soapenv:Envelope>
